#pragma once
#include "source2sdk/client/C_PointEntity.hpp"
#include "source2sdk/source2gen.hpp"
#include <cstddef>
#include <cstdint>

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk::client
{
    // Registered alignment: 0x8
    // Alignment: 0x8
    // Standard-layout class: false
    // Size: 0x588
    // Has VTable
    // Construct allowed
    // MClassHasEntityLimitedDataDesc
    // MNetworkAssumeNotNetworkable
    #pragma pack(push, 1)
    class CMapInfo : public client::C_PointEntity
    {
    public:
        int32_t m_iBuyingStatus; // 0x568        
        float m_flBombRadius; // 0x56c        
        int32_t m_iPetPopulation; // 0x570        
        bool m_bUseNormalSpawnsForDM; // 0x574        
        bool m_bDisableAutoGeneratedDMSpawns; // 0x575        
        [[maybe_unused]] std::uint8_t pad_0x576[0x2]; // 0x576
        float m_flBotMaxVisionDistance; // 0x578        
        int32_t m_iHostageCount; // 0x57c        
        bool m_bFadePlayerVisibilityFarZ; // 0x580        
        bool m_bRainTraceToSkyEnabled; // 0x581        
        [[maybe_unused]] std::uint8_t pad_0x582[0x6];
        
        // Datamap fields:
        // int32_t InputFireWinCondition; // 0x0
    };
    #pragma pack(pop)
    
    // Cannot assert offsets of fields in CMapInfo because it is not a standard-layout class
    static_assert(sizeof(CMapInfo) == 0x588);
};
